In [1]:
people = {
    "first_name":["Duyen le","Duyen le","NaN"],
    "last_name":"huu",
    "sdt":["0123","1234","3456"]
}

In [2]:
import pandas as pd

In [28]:
df = pd.DataFrame(people)

In [4]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1   Duyen le       huu  1234
2        NaN       huu  3456

In [5]:
df.sdt

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [6]:
df['sdt']

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [7]:
df[['sdt','first_name']]

    sdt first_name
0  0123   Duyen le
1  1234   Duyen le
2  3456        NaN

In [22]:
df.columns

Index(['index', 'first_name', 'last_name', 'sdt'], dtype='object')

In [29]:
df.iloc[[0,1],2]

0    0123
1    1234
Name: sdt, dtype: object

In [34]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1   Duyen le       huu  1234
2        NaN       huu  3456

In [32]:
df.loc[[0,2],"sdt"]

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [41]:
df.set_index('sdt',inplace=True)

In [42]:
df

     first_name last_name
sdt
0123   Duyen le       huu
1234   Duyen le       huu
3456        NaN       huu

In [43]:
df.index

Index(['0123', '1234', '3456'], dtype='object', name='sdt')

In [44]:
df.columns

Index(['first_name', 'last_name'], dtype='object')

In [47]:
df.reset_index(inplace=True)

In [48]:
df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234   Duyen le       huu
2  3456        NaN       huu

In [49]:
df["first_name"] == "Duyen le"

0     True
1     True
2    False
Name: first_name, dtype: bool

In [19]:
filt = (df["first_name"] == "Duyen le") | (df["sdt"] == "3456")

In [20]:
df[filt]

   index first_name last_name   sdt
0      0   Duyen le       huu  0123
1      1   Duyen le       huu  1234
2      2        NaN       huu  3456

In [21]:
df.loc[~filt,"sdt"]

Series([], Name: sdt, dtype: object)